Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
  // Setup Camera. esp_camera_init() can fail transiently on a marginal power
  // rail, so power-cycle and retry a few times rather than booting blind with
  // a dead sensor (which would silently upload empty photos).
  cameraPowerOn();
  int camera_attempts = 0;
  while (cameraSetup() == 0 && camera_attempts < 3) {
    camera_attempts++;
    Serial.printf("[CAM] init failed, retry %d/3\n", camera_attempts);
    esp_camera_deinit();  // release any partial init before re-attempting
    delay(250);
    cameraPowerOn();
  }
  if (camera_attempts >= 3) {
    Serial.println("[CAM] FAILED after 3 attempts; photo capture disabled");
  } else {
    Serial.println("[CAM] ready");
  }

  SPIFFS.begin(true);
  delay(100);

  // load saved variables
  preferences.begin("local", false);
  diagnosticsLogBoot();  // record reset reason + bump persisted boot counter for the Status tab
  ssid = preferences.getString("ssid", "NOT_SET");
  password = preferences.getString("pass", "NOT_SET");
  camera_id = preferences.getString("camera_id", "NOT_SET");  // Create an account and camera at tachtracker.com
  min_speed = preferences.getInt("min_speed", 3);             // The minimum speed (MPH) that the tracker should track any vehicle and upload data
  photo_speed = preferences.getInt("photo_speed", 10);        // Cars speed (MPH) when photo should be taken
  min_signal = preferences.getInt("min_signal", 0);           // Min radar echo strength to arm a run (0 = off; proximity gate, see variables.h)
  photo_signal = preferences.getInt("photo_signal", 0);       // Shared fire threshold (direction-aware proximity timing; 0 = off, capture at photo_speed)
  photo_signal_front = preferences.getInt("ps_front", 0);     // FRONT (oncoming) fire threshold; 0 = inherit photo_signal (raise to catch oncoming closer)
  photo_signal_rear = preferences.getInt("ps_rear", 0);       // REAR (receding) fire threshold; 0 = inherit photo_signal (lower to catch receding farther)
  is_kph = preferences.getBool("is_kph", 0);                  // Cars speed (MPH) when photo should be taken
  power_saver = preferences.getBool("power_saver", true);     // true = drop WiFi during idle (default); false = never sleep

  // Connect CDM324 sensor
  Serial.println("Connecting CDM324");
  Serial1.begin(1000000, SERIAL_8N1, RX_GPIO, TX_GPIO);
  Serial.setDebugOutput(false);

  // Reset CDM324
  digitalWrite(STM32_RESET_PIN, LOW);
  issue_cdm324_reset();

  // Read the STM32 firmware version now (before taskCore1 starts polling, so it
  // can't race get_speed() on the shared UART). Retry a few times in case the
  // STM32 is mid-FFT when the first query lands; stays "unknown" on old firmware.
  stm_fw_version = get_stm32_version();
  for (int i = 0; i < 3 && stm_fw_version == "unknown"; i++) {
    delay(50);
    stm_fw_version = get_stm32_version();
  }
  Serial.printf("[FW] esp=%s stm=%s\n", FW_VERSION, stm_fw_version.c_str());
  // Connect to WiFi or create Access Point
  connectWifiAP();
  if (WiFi.getMode() == WIFI_STA) {
    Serial.printf("[WIFI] STA ip=%s\n", WiFi.localIP().toString().c_str());
  } else {
    Serial.printf("[WIFI] AP ip=%s\n", WiFi.softAPIP().toString().c_str());
  }

  // Load ESPUI elements
  load_espui();

  // Wire the stream module's start/stop notifications to the ESPUI UI now that
  // the controls (labelStream / aimingSwitchId) exist.
  streamSetCallbacks(onStreamStarted, onStreamStopped);

  // Send local IP address to API if connected to internet
  sendLocalIP();

  // Put device to sleep after 120 seconds after setup
  sleep_time = millis() + 10000;  //120000
  wake_flag = true;

  // ignore device measurements for 5 seconds after startup
  ignore_time = millis() + 5000;
  ignore_flag = true;

  // Queue used to hand finished tracking runs from Core 1 to Core 0. Depth 2
  // lets a second event arrive while one is still uploading; deeper backlogs
  // are dropped (with a log) in taskCore1.
  uploadQueue = xQueueCreate(2, sizeof(UploadRequest));

  // Crash diagnostics are printed HERE, near the end of setup, on purpose: on
  // native USB-CDC the host monitor only reattaches a few seconds into boot, so
  // anything printed at the very top is missed. By now it's reliably connected.
  // This reveals why the previous boot ended -- BROWNOUT (5V rail dip, leaves no
  // core dump) vs PANIC/TASK_WDT (code fault, with a backtrace) vs a clean reset.
  esp_reset_reason_t last_reset = esp_reset_reason();
  Serial.printf("[DIAG] last reset: %s (code %d)\n", resetReasonStr(last_reset), (int)last_reset);
  reportLastCrash();

  Serial.printf("[BOOT] setup complete (heap=%u); starting tasks\n", (unsigned)ESP.getFreeHeap());

  xTaskCreatePinnedToCore(
    taskCore1,  // Task function
    "Task1",    // Name of the task
    10000,      // Stack size in words
    NULL,       // Task input parameter
    1,          // Priority of the task
    &Task1,     // Task handle
    1           // Core where the task should run
  );

  /* Place the network/upload task on core 0 */
  xTaskCreatePinnedToCore(
    taskCore0,  // Task function
    "Task0",    // Name of the task
    20000,      // Stack size in words
    NULL,       // Task input parameter
    1,          // Priority of the task (0 is lowest)
    &Task0,     // Task handle
    0           // Core where the task should run (0 or 1)
  );
}

/**
 * Arduino loop() - intentionally empty.
 *
 * All recurring work is performed in taskCore0 and taskCore1, which are
 * pinned to separate cores via xTaskCreatePinnedToCore() in setup().
 */
void loop() {
  // Loop not used. Use tasks intead for dual-core performance
}

unsigned long previousMillis = 0;  // Timestamp of last idle-sleep tick
const long interval = 5000;        // Idle window (ms) of zero-speed before sleeping

// A run only starts after this many consecutive readings >= min_speed. A lone
// noise spike that slips under the plausibility ceiling (see get_speed) lasts
// a single sample, so requiring 2 in a row rejects glitches while a real
// vehicle (many samples) still triggers immediately.
const int SPEED_CONFIRM_COUNT = 2;

// Direction-aware photo timing fallback: if a car never cleanly crosses
// photo_signal during its run, still fire once magnitude has fallen to this
// percent of the run's peak -- a best-effort "near closest approach" shot.
const int PHOTO_PEAK_DROP_PCT = 70;

/**
 * Core 1 task: radar polling, sleep policy, and ESPUI/DNS servicing.
 *
 * Each iteration:
 *   1. Services one captive-DNS request so the ESPUI page resolves.
 *   2. Releases the post-startup "ignore" window after 5s.
 *   3. Polls the STM32 for the latest speed (in MPH or KPH per user setting).
 *   4. Manages two sleep/idle paths (post-boot grace, and 5s of no radar).
 *   5. Triggers WiFi reconnect (handed off to Core 0) when the radar wakes.
 *   6. When speed >= min_speed, tracks the run's max speed, captures one
 *      frame once at photo_speed, and posts a single UploadRequest to
 *      Core 0 via uploadQueue when the run ends.
 *   7. Polls the WiFi-reset button.
 */
void taskCore1(void* parameter) {  // Code for task running on Core 1
  while (1) {                      // Loop indefinitely

    dnsServer.processNextRequest();  // Process request for ESPUI

    streamService();  // start/stop the aiming MJPEG stream + enforce its auto-off timeout

    // While the aiming stream is up, skip all measurement work below: the radar
    // reads are meaningless (and WiFi-TX-corrupted) during aiming, and keeping
    // taskCore1 quiet here frees the radio/CPU for a smooth stream. The short
    // yield replaces get_speed()'s usual loop pacing so we don't busy-spin.
    if (stream_active) {
      vTaskDelay(pdMS_TO_TICKS(20));
      continue;
    }

    // While Core 0 is reflashing the STM32 it owns UART1 for the bootloader, so
    // taskCore1 must not poll the radar over the same UART until it's done.
    if (stm_flash_busy) {
      vTaskDelay(pdMS_TO_TICKS(50));
      continue;
    }

    if (ignore_flag == true) {
      if (millis() >= ignore_time) {
        ignore_flag = false;  // Only if 5 seconds passed
      }
    }

    if (is_kph == true) {
      speed = get_speed(true);  // Get speed (KPH) from STM32 via UART
    } else {
      speed = get_speed(false);  // Get speed (MPH) from STM32 via UART
    }

    // While the aiming stream runs, DON'T push ESPUI label updates: each one is
    // a WebSocket broadcast over AsyncTCP (:80), and under the stream's WiFi/LWIP
    // saturation that send blocks -- hanging this whole task (the ~30s freeze:
    // radar, serial, stream AND ESPUI all stop until TCP times out). The live
    // labels aren't needed while aiming; they resume when the stream stops.
    if (!stream_active) {
      updateSpeedDisplay();   // push the live reading to the ESPUI "Current Speed" label
      updateStatusDisplay();  // refresh the ESPUI Status tab (~1 Hz, self-throttled)
    }

    // Echo the live speed to the serial monitor, throttled to ~1 Hz so the
    // fast radar-poll loop doesn't flood the console.
    static unsigned long lastSpeedPrint = 0;
    if (millis() - lastSpeedPrint >= 1000) {
      lastSpeedPrint = millis();
      Serial.printf("[SPEED] %d %s\n", speed, is_kph ? "kph" : "mph");
    }

    /* SLEEP - 120 Seconds after startup
     *  Gives time for user to make changes over WiFi.
     *  Skipped entirely when Power-Saver Mode is off (device stays awake).
     */

    // Never power down WiFi while unconfigured: the soft-AP must stay up so
    // the user can open the portal and enter credentials (ssid == "NOT_SET").
    if (power_saver && !stream_active && ssid != "NOT_SET" && wake_flag == true) {
      if (millis() >= sleep_time) {              // Only if 120 seconds passed
        if (digitalRead(ESP_WAKEUP_PIN) == 0) {  // Only if STM not measuring data
          wake_flag = false;
          Serial.println("[PWR] idle: WiFi off (post-boot grace elapsed)");

          //esp_light_sleep_start(); // Do not sleep in version 1.1
          WiFi.disconnect(true);  // Disconnect from network, optionally true to remove credentials
          WiFi.mode(WIFI_OFF);    // Set Wi-Fi mode to OFF

          // Add power camera off to save battery
          // To initiate hardware power-down, the PWDN pin must be tied to high.
          // Power camera on after speed is detected
          //cameraPowerOn();  // power on camera after waking?
        }
      }
    }

