Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
    /* SLEEP - 5 seconds of no activity on radar (Power-Saver Mode only) */
    unsigned long currentMillis = millis();

    if (power_saver && !stream_active && ssid != "NOT_SET" && wake_flag == false) {
      if (speed == 0) {  // Check if speed is 0
        if (currentMillis - previousMillis >= interval) {
          previousMillis = currentMillis;      // Save the last time
          Serial.println("[PWR] idle: WiFi off (no radar activity 5s)");

          //esp_light_sleep_start(); // Do not Go to sleep on R1.1 because USB will disconnect
          WiFi.disconnect(true);  // Disconnect from network, optionally true to remove credentials
          WiFi.mode(WIFI_OFF);    // Set Wi-Fi mode to OFF
          previousMillis = millis();

          // Add power camera off to save battery
          // To initiate hardware power-down, the PWDN pin must be tied to high.
          // Power camera on after speed is detected
          //cameraPowerOn();  // power on camera after waking?
        }
      }
    }

    // Checks if wifi is disconnected and sets connect flag to true. Connection will occur on Core 0
    if (digitalRead(ESP_WAKEUP_PIN) == 1) { // Check if speed detected on radar first. Use interrupt for this instead?
      // Only request a reconnect when we actually have credentials to use.
      // In AP config mode (ssid == "NOT_SET") WiFi.status() is never
      // WL_CONNECTED, so without this guard we'd flag a reconnect every loop
      // and connectWifi() would tear the soft-AP down.
      if (ssid != "NOT_SET" && !ssid.isEmpty() && WiFi.status() != WL_CONNECTED) {
        connect_wifi = true;
      }
      // Power on camera here? Need to check if it's powered down first

    }

    // Pause speed tracking while the aiming stream is up: the device is being
    // mounted (not measuring), and the stream task owns the camera framebuffer.
    if (ignore_flag == false && !stream_active) {
      // A sample qualifies to arm a run only if it is both fast enough AND
      // close enough: speed >= min_speed and the radar echo magnitude >=
      // min_signal (the proximity gate -- distant cross-traffic returns a weak
      // peak even at speed, so it never qualifies). min_signal == 0 disables
      // the gate (g_last_peak_mag >= 0 is always true), preserving prior
      // behavior until the user calibrates it.
      const bool qualifies =
          (speed >= min_speed) && ((int)g_last_peak_mag >= min_signal);

      // Telemetry: a sample fast enough to arm but too weak (distant cross-
      // traffic the proximity gate dropped). Counts the rejection rate so the
      // gate can be judged remotely. Only meaningful when the gate is enabled.
      if (min_signal > 0 && speed >= min_speed && (int)g_last_peak_mag < min_signal) {
        g_reject_proximity++;
      }

      // Debounce: count consecutive qualifying readings; a single glitch
      // resets the count, so it can never reach SPEED_CONFIRM_COUNT.
      static int speedConfirmCount = 0;
      if (qualifies) {
        speedConfirmCount++;
      } else {
        speedConfirmCount = 0;
      }

      if (qualifies && speedConfirmCount >= SPEED_CONFIRM_COUNT) {
        speedConfirmCount = 0;  // consumed; the run loop below tracks the pass

        Serial.printf("[RUN] start: speed=%d >= min_speed=%d, mag=%u >= min_signal=%d (confirmed)\n",
                      speed, min_speed, (unsigned)g_last_peak_mag, min_signal);

        delay(100);
        maxSpeed = 0;               // Tracks the max speed over the entire pass
        bool photo_taken = false;   // ensures we capture at most one frame per run
        camera_fb_t* fb = nullptr;  // held framebuffer, handed to Core 0 for streaming

        // --- Per-event telemetry accumulators (uploaded with the run) ------
        // Seeded from the arming sample so it's counted; updated each loop.
        const unsigned long run_start = millis();
        uint32_t speed_sum = (speed > 0) ? (uint32_t)speed : 0;  // for mean speed
        uint16_t sample_count = (speed > 0) ? 1 : 0;             // valid frames in the run
        uint16_t peak_snr = g_last_peak_snr;                     // strongest SNR seen
        int direction = 0;                                       // 0 unk, 1 approaching, 2 receding
        uint16_t mag_first = g_last_peak_mag;                    // first/last valid mag, for the
        uint16_t mag_last = g_last_peak_mag;                     //   no-proximity direction fallback

        // --- Direction-aware photo timing (proximity, two thresholds) -------
        // With the unit aimed down the road the echo magnitude (g_last_peak_mag,
        // ~1/r^4) RISES for an oncoming car and FALLS for a receding one. We fire
        // the FRONT shot when a rising echo crosses UP through thr_front, and the
        // REAR shot when a falling echo crosses DOWN through thr_rear. Two
        // thresholds because a car's front reflects far stronger than its rear
        // (so one value frames them at different distances) AND the shots want
        // different framing: RAISE thr_front to catch oncoming closer, LOWER
        // thr_rear to catch receding farther out. Each inherits the shared
        // photo_signal when left at 0, so the old one-knob config still works;
        // both 0 keeps the legacy "first frame past photo_speed" behavior. Keep
        // both >= Min Signal (the arming gate), and Min Signal below thr_front so
        // an oncoming car arms before it crosses (else only the rear/peak fires).
        const int thr_front = (photo_signal_front > 0) ? photo_signal_front : photo_signal;
        const int thr_rear  = (photo_signal_rear  > 0) ? photo_signal_rear  : photo_signal;
        const bool prox_enabled = (thr_front > 0) || (thr_rear > 0);
        bool prev_above_front = (thr_front > 0) && ((int)g_last_peak_mag >= thr_front);
        bool prev_above_rear  = (thr_rear  > 0) && ((int)g_last_peak_mag >= thr_rear);
        uint16_t peak_mag = g_last_peak_mag;
        const char* plate = "legacy";

        while (speed >= min_speed) {  // Track the car's maximum speed over the whole pass.
          speed = get_speed(is_kph);  // Get speed (KPH or MPH per setting) from STM32 via UART
          updateSpeedDisplay();       // keep the ESPUI readout live during the pass

          if (speed > maxSpeed) {
            maxSpeed = speed;
            Serial.print("New maxSpeed: ");
            Serial.println(maxSpeed);
          }

          // Run-profile telemetry: accumulate valid samples for the mean speed.
          if (speed > 0) {
            speed_sum += (uint32_t)speed;
            sample_count++;
          }

          // A 0 magnitude is "no valid target this sample" -- the STM32 had no
          // fresh FFT, or the reply failed the checksum (both common on this
          // noisy shared-rail board; see INTERFACE.md / get_speed()). It is NOT
          // "the echo fell to zero," so it must not look like a DOWN-crossing:
          // that would fire a bogus REAR-plate shot (and latch photo_taken) on a
          // single dropped or corrupted reply. So act only on samples that carry
          // a real echo and hold the crossing state across a dropout. Legacy mode
          // (prox disabled) ignores magnitude and is unaffected.
          if (prox_enabled && g_last_peak_mag == 0) {
            // dropped/noisy sample: no proximity info -- hold crossing state
          } else {
            if (g_last_peak_mag > peak_mag) peak_mag = g_last_peak_mag;
            if (g_last_peak_snr > peak_snr) peak_snr = g_last_peak_snr;
            if (g_last_peak_mag > 0) {       // first/last real echo, for the trend fallback
              if (mag_first == 0) mag_first = g_last_peak_mag;
              mag_last = g_last_peak_mag;
            }
            const bool now_above_front = (thr_front > 0) && ((int)g_last_peak_mag >= thr_front);
            const bool now_above_rear  = (thr_rear  > 0) && ((int)g_last_peak_mag >= thr_rear);

